app/views/users/show.html.erb

			<tbody>
				<% @user.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 3]]

					<td><%= book.body %></td>
					<td><%= book.book_comments.count %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]