app/views/books/index.html.erb

                    <td>
                    <% if !book.favorite_users.include?(current_user) %>
---
SELECT  1 AS one FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."id" = ? LIMIT ?  [["book_id", 1], ["id", 1], ["LIMIT", 1]]

			       </td>
			       <td><%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]