app/views/books/show.html.erb

SELECT  1 AS one FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."id" = ? LIMIT ?  [["book_id", 1], ["id", 1], ["LIMIT", 1]]
---
					<td>
                    <% if !@book.favorite_users.include?(current_user) %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
			       </td>
		       	   <td><%= @book.book_comments.count %></td>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
---
			<tr>
				<% @book.book_comments.each do |comment| %>