app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "created_at", "updated_at", "comment") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["book_id", 1], ["created_at", "2020-11-04 21:11:16.481748"], ["updated_at", "2020-11-04 21:11:16.481748"], ["comment", "ddd"]]
---
	def create
		book = Book.find(params[:book_id])
		comment = BookComment.new(book_comment_params)
		comment.user_id = current_user.id
		comment.book_id = book.id
		if comment.save

SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]
---
def destroy
	book_comment = BookComment.find(params[:id])
	book_comment.destroy