app/controllers/favorites_controller.rb

def create
    favorite = Favorite.new
    favorite.user_id = current_user.id
    favorite.book_id = params[:book_id]

    if favorite.save
---
INSERT INTO "favorites" ("created_at", "updated_at", "book_id", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2020-11-04 20:02:18.762537"], ["updated_at", "2020-11-04 20:02:18.762537"], ["book_id", 1], ["user_id", 1]]

def destroy
	 favorite = Favorite.find_by(user_id: current_user.id, book_id: params[:book_id])

    favorite.destroy if favorite.present?
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 163]]